In [2]:
import numpy as np
print(np.__version__) #test (first NB on vscode)

1.19.2

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
# get all the libraries

In [2]:

# structure of submission-----------------------------
gender_data = pd.read_csv("gender_submission.csv")
gender_data.to_csv("gs.csv",index=False)
gender_data.head()
# structure of submission-----------------------------

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [3]:
test_data = pd.read_csv("test.csv")
train_data = pd.read_csv("train.csv")
test_data.head(8)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S

In [4]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:

train_data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [54]:
# x['Cabin'].isnull().sum()
# print("number of NaN: ")
# for column in train_data:
#     print(f'NaN count in {column} = {x[column].isnull().sum()}')

# feature cleaning
------------------------------------------------

In [60]:
print( train_data[["Pclass","Survived"]].groupby(["Pclass"], as_index = False).mean() )

# The impact is very large

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [63]:
print( train_data[["Sex","Survived"]].groupby(["Sex"], as_index = False).mean() )
# Again The impact is very large

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [5]:
data = train_data['SibSp'] + train_data['Parch'] + 1
len(data)

891

In [6]:
train_data['Family'] = data
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [71]:
print( train_data[["Family","Survived"]].groupby(["Family"], as_index = False).mean() )

   Family  Survived
0       1  0.303538
1       2  0.552795
2       3  0.578431
3       4  0.724138
4       5  0.200000
5       6  0.136364
6       7  0.333333
7       8  0.000000
8      11  0.000000

## Inverse proportion, Impact: noticable, significant, but not as much as previous features

#### Need to note that the percentage for survival is high in case of the 4 family members, should persue it next

In [7]:

train_data['Travel_alone'] = 0
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,0

In [8]:
train_data.loc[train_data['Family'] == 1, 'Travel_alone'] = 1

In [9]:
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1

In [14]:
print (train_data[['Travel_alone', 'Survived']].groupby(['Travel_alone'], as_index=False).mean())

   Travel_alone  Survived
0             0  0.505650
1             1  0.303538

In [23]:
print(train_data['Embarked'].value_counts())
print(f'{644/891 * 100}% of \'S\'')
print(train_data['Embarked'].isna().sum())

S    644
C    168
Q     77
Name: Embarked, dtype: int64
72.27833894500561% of 'S'
2

### mean will be 'S' so fill NaN in the column with 'S'

In [10]:
train_data['Embarked'] = train_data['Embarked'].fillna('S')
# train_data
print(train_data['Embarked'].isna().sum())

0

### check for NaN

In [11]:
print('-----------Median--------------')
print( train_data[["Pclass","Fare"]].groupby(["Pclass"], as_index = False).median() )


print('\n \n-----------Mean----------------')

print( train_data[["Pclass","Fare"]].groupby(["Pclass"], as_index = False).mean() )

-----------Median--------------
   Pclass     Fare
0       1  60.2875
1       2  14.2500
2       3   8.0500


-----------Mean----------------
   Pclass       Fare
0       1  84.154687
1       2  20.662183
2       3  13.675550

In [ ]:
## The fares for passenger classes must be in a very different ranges (obviously). So group according to classes and median
## The fares paid by the passengers vary greatly(looks like "not normal distribution" ) so mean is avoided.

# Testing Various methods
---------------------------------------------------------------------

In [18]:
train_data['test_column'] = 0
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,test_column
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,0

In [19]:
train_data.loc[train_data['Age'] > 25, 'test_column'] = 55
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,test_column
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,55
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,55
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,55
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,55
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,55
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,55
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,55

In [29]:
# Worked for multiple expression filtering
train_data['test_column'] = np.where((train_data['Age']>=25) & (train_data['PassengerId'] > 4), 'yes', 'no')
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,test_column
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,no
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,no
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,no
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,no
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,yes
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,no
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,no
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,yes
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,yes

In [37]:
train_data['test_column'] = np.where((train_data['Age']==22) & (train_data['Cabin'].isna()), 'yes', 'no')
train_data
# Worked for cabin being NaN

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,test_column,Fare_bool
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,yes,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,no,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,no,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,no,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,no,False
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,no,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,no,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,no,False
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,no,False

# Now dont require Fare_bool column

In [34]:
# train_data['Fare_bool'] = train_data['Fare'].isnull()
# train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,test_column,Fare_bool
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,no,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,no,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,no,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,no,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,yes,False
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,no,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,no,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,yes,False
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,yes,False

In [35]:
# train_data['test_column'] = np.where((train_data['Age']==22) & (train_data[''] == False), 'yes', 'no')
# train_data

SyntaxError: invalid syntax (<ipython-input-35-3ffa9338cfd3>, line 1)

In [16]:
# train_data['test_column'] = np.where((train_data['PassengerId']==2) & (train_data['Cabin'].isna()),60.2875 ,'done')
# train_data[train_data['PassengerId']==2 and train_data['Cabin'].isna()]


#link explanation => https://stackoverflow.com/questions/21263020/pandas-update-value-if-condition-in-3-columns-are-met
# df.loc[(df['A'] == 'blue') & (df['B'] == 'red') & (df['C'] == 'square'),'D'] = 'M5'
train_data.loc[(train_data['PassengerId'] <= 3) & (train_data['Age']<40),'test_column'] = 'good Yes'
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,test_column
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,good Yes
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,good Yes
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,good Yes
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,NaN
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,NaN
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,NaN

# Done Testing
----------------------------------------------------------------------------

In [12]:
# Using median
train_data.loc[(train_data['Pclass'] == 3) & (train_data['Fare'].isna() ),'Fare'] = 8.0500
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1

In [13]:
train_data.loc[(train_data['Pclass'] == 2) & (train_data['Fare'].isna() ),'Fare'] = 14.2500
train_data.loc[(train_data['Pclass'] == 1) & (train_data['Fare'].isna() ),'Fare'] = 60.2875
print(train_data['Fare'].isna().sum())# check for NaN data

0

In [21]:
# print(train_data[train_data['Fare']==1])
# print (train_data[['Pclass', 'Fare']].groupby(['Fare'], as_index=False))
# print (train_data[['Pclass', 'Fare']])

     Pclass     Fare
0         3   7.2500
1         1  71.2833
2         3   7.9250
3         1  53.1000
4         3   8.0500
..      ...      ...
886       2  13.0000
887       1  30.0000
888       3  23.4500
889       1  30.0000
890       3   7.7500

[891 rows x 2 columns]

## Age

In [13]:
print(train_data['Age'].isna().sum())# check for NaN data

177

## Getting the title can give a rough idea of age bracket of the passengers

In [14]:
import re
def get_title(name):
    title_search = re.search(' ([A-Za-z]+)\. ', name)
    if title_search:
        return title_search.group(1)
    return ""

In [15]:
train_data['title'] = train_data['Name'].apply(get_title)
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,Rev
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,Mr

In [27]:
print(pd.crosstab(train_data['title'], train_data['Sex']))
print("----------------------")
print(train_data[['title','Survived']].groupby(['title'], as_index = False).mean())

Sex       female  male
title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1
----------------------
       title  Survived
0       Capt  0.000000
1        Col  0.500000
2   Countess  1.000000
3        Don  0.000000
4         Dr  0.428571
5   Jonkheer  0.000000
6       Lady  1.000000
7      Major  0.500000
8     Master  0.575000
9       Miss  0.697802
10      Mlle  1.000000
11       Mme  1.000000
12        Mr  0.156673
13       Mrs  0.792000
14        Ms  1.000000
15       Rev  0.000000
16       Sir  1.000000

## The 'Title' requires further cleaning

In [16]:
train_data['title'] = train_data['title'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer','Dona'],'Rare')
train_data['title'] = train_data['title'].replace('Mlle','Miss')
train_data['title'] = train_data['title'].replace('Ms','Miss')
train_data['title'] = train_data['title'].replace('Mme','Mrs')
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,Rare
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,Mr

In [17]:
print(pd.crosstab(train_data['title'], train_data['Sex']))
print("----------------------")
print(train_data[['title','Survived']].groupby(['title'], as_index = False).mean())
print("----------------------")
print('\n mean : ')
print("----------------------")
print(train_data[['title','Age']].groupby(['title'], as_index = False).mean())
print("----------------------")
print('\n median : ')
print("----------------------")
print(train_data[['title','Age']].groupby(['title'], as_index = False).median())

Sex     female  male
title
Master       0    40
Miss       185     0
Mr           0   517
Mrs        126     0
Rare         3    20
----------------------
    title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4    Rare  0.347826
----------------------

 mean :
----------------------
    title        Age
0  Master   4.574167
1    Miss  21.845638
2      Mr  32.368090
3     Mrs  35.788991
4    Rare  45.545455
----------------------

 median :
----------------------
    title   Age
0  Master   3.5
1    Miss  21.0
2      Mr  30.0
3     Mrs  35.0
4    Rare  48.5

In [18]:
# get approx data for age based on title (as above cell)
train_data.loc[(train_data['title'] == 'Master') & (train_data['Age'].isna() ),'Age'] = 4.574167
train_data.loc[(train_data['title'] == 'Miss') & (train_data['Age'].isna() ),'Age'] = 21.845638
train_data.loc[(train_data['title'] == 'Mr') & (train_data['Age'].isna() ),'Age'] = 32.368090
train_data.loc[(train_data['title'] == 'Mrs') & (train_data['Age'].isna() ),'Age'] = 35.788991
train_data.loc[(train_data['title'] == 'Rare') & (train_data['Age'].isna() ),'Age'] = 45.545455
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S,2,0,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,2,0,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S,2,0,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S,1,1,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S,1,1,Rare
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S,1,1,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,21.845638,1,2,W./C. 6607,23.4500,NaN,S,4,0,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C,1,1,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q,1,1,Mr

In [19]:
print(train_data['Age'].isna().sum())# check for NaN data
print(train_data['title'].isna().sum())# check for NaN data

0
0

In [ ]:
# family == single
# fare == median
# age == mean

# End of feature cleaning (I guess 🤞)

------------------------------------------------------------------

# Feature mapping
----------------------------------------------------------------------

### Sex feature mapping

In [19]:
sex_map = { 'female':0 , 'male':1 } # ;)
train_data['Sex'] = train_data['Sex'].map(sex_map).astype(int)
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,title
0,1,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,NaN,S,2,0,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C,2,0,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S,2,0,Mrs
4,5,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,NaN,S,1,1,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",1,27.000000,0,0,211536,13.0000,NaN,S,1,1,Rare
887,888,1,1,"Graham, Miss. Margaret Edith",0,19.000000,0,0,112053,30.0000,B42,S,1,1,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,21.845638,1,2,W./C. 6607,23.4500,NaN,S,4,0,Miss
889,890,1,1,"Behr, Mr. Karl Howell",1,26.000000,0,0,111369,30.0000,C148,C,1,1,Mr
890,891,0,3,"Dooley, Mr. Patrick",1,32.000000,0,0,370376,7.7500,NaN,Q,1,1,Mr

### Title feature mapping

In [20]:
title_map = {'Mr':1, 'Miss':2, 'Mrs':3, 'Master':4, 'Rare':5}
train_data['title'] = train_data['title'].map(title_map).astype(int)
train_data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,title
0,1,0,3,"Braund, Mr. Owen Harris",1,22.00000,1,0,A/5 21171,7.2500,NaN,S,2,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.00000,1,0,PC 17599,71.2833,C85,C,2,0,3
2,3,1,3,"Heikkinen, Miss. Laina",0,26.00000,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.00000,1,0,113803,53.1000,C123,S,2,0,3
4,5,0,3,"Allen, Mr. William Henry",1,35.00000,0,0,373450,8.0500,NaN,S,1,1,1
5,6,0,3,"Moran, Mr. James",1,32.36809,0,0,330877,8.4583,NaN,Q,1,1,1
6,7,0,1,"McCarthy, Mr. Timothy J",1,54.00000,0,0,17463,51.8625,E46,S,1,1,1
7,8,0,3,"Palsson, Master. Gosta Leonard",1,2.00000,3,1,349909,21.0750,NaN,S,5,0,4
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.00000,0,2,347742,11.1333,NaN,S,3,0,3
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.00000,1,0,237736,30.0708,NaN,C,2,0,3

### Mapping feature Embarked

In [21]:
embark_map = {'S':0, 'C':1, 'Q':2}
train_data['Embarked'] = train_data['Embarked'].map(embark_map).astype(int)

In [22]:
train_data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,Travel_alone,title
0,1,0,3,"Braund, Mr. Owen Harris",1,22.00000,1,0,A/5 21171,7.2500,NaN,0,2,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.00000,1,0,PC 17599,71.2833,C85,1,2,0,3
2,3,1,3,"Heikkinen, Miss. Laina",0,26.00000,0,0,STON/O2. 3101282,7.9250,NaN,0,1,1,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.00000,1,0,113803,53.1000,C123,0,2,0,3
4,5,0,3,"Allen, Mr. William Henry",1,35.00000,0,0,373450,8.0500,NaN,0,1,1,1
5,6,0,3,"Moran, Mr. James",1,32.36809,0,0,330877,8.4583,NaN,2,1,1,1
6,7,0,1,"McCarthy, Mr. Timothy J",1,54.00000,0,0,17463,51.8625,E46,0,1,1,1
7,8,0,3,"Palsson, Master. Gosta Leonard",1,2.00000,3,1,349909,21.0750,NaN,0,5,0,4
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.00000,0,2,347742,11.1333,NaN,0,3,0,3
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.00000,1,0,237736,30.0708,NaN,1,2,0,3

# Feature selection
## Remove unwanted data

In [24]:
# drop_elements = ["Name", "Ticket", "Cabin", "SibSp", "Parch", "Family","test_column"] #columns to drop
drop_elements = ["Name", "Ticket", "Cabin", "SibSp", "Parch", "Family"] 
train_data = train_data.drop(drop_elements, axis = 1)
train_data.head(10)

,PassengerId,Survived,Pclass,Sex,Age,Fare,Embarked,Travel_alone,title
0,1,0,3,1,22.00000,7.2500,0,0,1
1,2,1,1,0,38.00000,71.2833,1,0,3
2,3,1,3,0,26.00000,7.9250,0,1,2
3,4,1,1,0,35.00000,53.1000,0,0,3
4,5,0,3,1,35.00000,8.0500,0,1,1
5,6,0,3,1,32.36809,8.4583,2,1,1
6,7,0,1,1,54.00000,51.8625,0,1,1
7,8,0,3,1,2.00000,21.0750,0,0,4
8,9,1,3,0,27.00000,11.1333,0,0,3
9,10,1,2,0,14.00000,30.0708,1,0,3

### Id doesnt effect the result as it has same function as serial number of data.

In [25]:
train_data = train_data.drop("PassengerId", axis = 1)
train_data.head(10)

   Survived  Pclass  Sex       Age     Fare  Embarked  Travel_alone  title
0         0       3    1  22.00000   7.2500         0             0      1
1         1       1    0  38.00000  71.2833         1             0      3
2         1       3    0  26.00000   7.9250         0             1      2
3         1       1    0  35.00000  53.1000         0             0      3
4         0       3    1  35.00000   8.0500         0             1      1
5         0       3    1  32.36809   8.4583         2             1      1
6         0       1    1  54.00000  51.8625         0             1      1
7         0       3    1   2.00000  21.0750         0             0      4
8         1       3    0  27.00000  11.1333         0             0      3
9         1       2    0  14.00000  30.0708         1             0      3

In [26]:
x = train_data.drop('Survived',axis=1)
y = train_data['Survived']
x.dtypes

Pclass            int64
Sex               int32
Age             float64
Fare            float64
Embarked          int32
Travel_alone      int64
title             int32
dtype: object

In [52]:
y.dtypes

dtype('int64')

In [55]:
x.head(10)

   Pclass  Sex       Age     Fare  Embarked  Travel_alone  title
0       3    1  22.00000   7.2500         0             0      1
1       1    0  38.00000  71.2833         1             0      3
2       3    0  26.00000   7.9250         0             1      2
3       1    0  35.00000  53.1000         0             0      3
4       3    1  35.00000   8.0500         0             1      1
5       3    1  32.36809   8.4583         2             1      1
6       1    1  54.00000  51.8625         0             1      1
7       3    1   2.00000  21.0750         0             0      4
8       3    0  27.00000  11.1333         0             0      3
9       2    0  14.00000  30.0708         1             0      3

In [56]:
y.head(10)

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [57]:
test_data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [27]:
print("number of NaN: ")
for column in test_data:
    print(f'NaN count in {column} = {test_data[column].isnull().sum()}')
#Number of NaN in the dataset

number of NaN:
NaN count in PassengerId = 0
NaN count in Pclass = 0
NaN count in Name = 0
NaN count in Sex = 0
NaN count in Age = 86
NaN count in SibSp = 0
NaN count in Parch = 0
NaN count in Ticket = 0
NaN count in Fare = 1
NaN count in Cabin = 327
NaN count in Embarked = 0

# Feature cleaning for test data

In [28]:
# Age has more NaN 
test_data['title'] = test_data['Name'].apply(get_title)
test_data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Mr
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,Mrs
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,Mr
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,Mr
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,Mr
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,Dona
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,Mr
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,Mr
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,Master

In [64]:
print(pd.crosstab(test_data['title'], test_data['Sex']))

Sex     female  male
title
Col          0     2
Dona         1     0
Dr           0     1
Master       0    21
Miss        78     0
Mr           0   240
Mrs         72     0
Ms           1     0
Rev          0     2

In [29]:
test_data['title'] = test_data['title'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer','Dona'],'Rare')
test_data['title'] = test_data['title'].replace('Mlle','Miss')
test_data['title'] = test_data['title'].replace('Ms','Miss')
test_data['title'] = test_data['title'].replace('Mme','Mrs')
test_data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Mr
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,Mrs
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,Mr
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,Mr
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,Mr
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,Rare
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,Mr
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,Mr
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,Master

In [30]:
print(pd.crosstab(test_data['title'], test_data['Sex']))
print("----------------------")
print('\n mean : ')
print("----------------------")
print(test_data[['title','Age']].groupby(['title'], as_index = False).mean())
print("----------------------")
print('\n median : ')
print("----------------------")
print(test_data[['title','Age']].groupby(['title'], as_index = False).median())

Sex     female  male
title
Master       0    21
Miss        79     0
Mr           0   240
Mrs         72     0
Rare         1     5
----------------------

 mean :
----------------------
    title        Age
0  Master   7.406471
1    Miss  21.774844
2      Mr  32.000000
3     Mrs  38.903226
4    Rare  43.833333
----------------------

 median :
----------------------
    title   Age
0  Master   7.0
1    Miss  22.0
2      Mr  28.5
3     Mrs  36.5
4    Rare  44.0

In [31]:
# get approx data for age based on title (as above cell)
test_data.loc[(test_data['title'] == 'Master') & (test_data['Age'].isna() ),'Age'] = 7.406471
test_data.loc[(test_data['title'] == 'Miss') & (test_data['Age'].isna() ),'Age'] = 21.774844
test_data.loc[(test_data['title'] == 'Mr') & (test_data['Age'].isna() ),'Age'] = 32.000000
test_data.loc[(test_data['title'] == 'Mrs') & (test_data['Age'].isna() ),'Age'] = 38.903226
test_data.loc[(test_data['title'] == 'Rare') & (test_data['Age'].isna() ),'Age'] = 43.833333
test_data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title
0,892,3,"Kelly, Mr. James",male,34.500000,0,0,330911,7.8292,NaN,Q,Mr
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.000000,1,0,363272,7.0000,NaN,S,Mrs
2,894,2,"Myles, Mr. Thomas Francis",male,62.000000,0,0,240276,9.6875,NaN,Q,Mr
3,895,3,"Wirz, Mr. Albert",male,27.000000,0,0,315154,8.6625,NaN,S,Mr
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.000000,1,1,3101298,12.2875,NaN,S,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,32.000000,0,0,A.5. 3236,8.0500,NaN,S,Mr
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.000000,0,0,PC 17758,108.9000,C105,C,Rare
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.500000,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,Mr
416,1308,3,"Ware, Mr. Frederick",male,32.000000,0,0,359309,8.0500,NaN,S,Mr
417,1309,3,"Peter, Master. Michael J",male,7.406471,1,1,2668,22.3583,NaN,C,Master

In [32]:
print(train_data['Age'].isna().sum())# check for NaN data

0

In [33]:
print('-----------Median--------------')
print( test_data[["Pclass","Fare"]].groupby(["Pclass"], as_index = False).median() )


print('\n \n-----------Mean----------------')

print( test_data[["Pclass","Fare"]].groupby(["Pclass"], as_index = False).mean() )

-----------Median--------------
   Pclass     Fare
0       1  60.0000
1       2  15.7500
2       3   7.8958


-----------Mean----------------
   Pclass       Fare
0       1  94.280297
1       2  22.202104
2       3  12.459678

In [34]:
test_data.loc[(test_data['Pclass'] == 3) & (test_data['Fare'].isna() ),'Fare'] = 7.8958
test_data.loc[(test_data['Pclass'] == 2) & (test_data['Fare'].isna() ),'Fare'] = 15.7500
test_data.loc[(test_data['Pclass'] == 1) & (test_data['Fare'].isna() ),'Fare'] = 60.0000
test_data.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Mr
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,Mrs
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,Mr
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,Mr
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,Mrs
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S,Mr
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q,Miss
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S,Mr
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C,Mrs
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S,Mr

In [35]:
print("number of NaN: ")
for column in test_data:
    print(f'NaN count in {column} = {test_data[column].isnull().sum()}')

number of NaN:
NaN count in PassengerId = 0
NaN count in Pclass = 0
NaN count in Name = 0
NaN count in Sex = 0
NaN count in Age = 0
NaN count in SibSp = 0
NaN count in Parch = 0
NaN count in Ticket = 0
NaN count in Fare = 0
NaN count in Cabin = 327
NaN count in Embarked = 0
NaN count in title = 0

In [36]:
sex_map = { 'female':0 , 'male':1 } # ;)
test_data['Sex'] = test_data['Sex'].map(sex_map).astype(int)
test_data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title
0,892,3,"Kelly, Mr. James",1,34.500000,0,0,330911,7.8292,NaN,Q,Mr
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.000000,1,0,363272,7.0000,NaN,S,Mrs
2,894,2,"Myles, Mr. Thomas Francis",1,62.000000,0,0,240276,9.6875,NaN,Q,Mr
3,895,3,"Wirz, Mr. Albert",1,27.000000,0,0,315154,8.6625,NaN,S,Mr
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.000000,1,1,3101298,12.2875,NaN,S,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",1,32.000000,0,0,A.5. 3236,8.0500,NaN,S,Mr
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.000000,0,0,PC 17758,108.9000,C105,C,Rare
415,1307,3,"Saether, Mr. Simon Sivertsen",1,38.500000,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,Mr
416,1308,3,"Ware, Mr. Frederick",1,32.000000,0,0,359309,8.0500,NaN,S,Mr
417,1309,3,"Peter, Master. Michael J",1,7.406471,1,1,2668,22.3583,NaN,C,Master

In [37]:
title_map = {'Mr':1, 'Miss':2, 'Mrs':3, 'Master':4, 'Rare':5}
test_data['title'] = test_data['title'].map(title_map).astype(int)
test_data.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S,3
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,Q,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,S,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S,3
5,897,3,"Svensson, Mr. Johan Cervin",1,14.0,0,0,7538,9.2250,NaN,S,1
6,898,3,"Connolly, Miss. Kate",0,30.0,0,0,330972,7.6292,NaN,Q,2
7,899,2,"Caldwell, Mr. Albert Francis",1,26.0,1,1,248738,29.0000,NaN,S,1
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",0,18.0,0,0,2657,7.2292,NaN,C,3
9,901,3,"Davies, Mr. John Samuel",1,21.0,2,0,A/4 48871,24.1500,NaN,S,1

In [38]:
embark_map = {'S':0, 'C':1, 'Q':2}
test_data['Embarked'] = test_data['Embarked'].map(embark_map).astype(int)
test_data.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,2,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,0,3
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,2,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,0,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,0,3
5,897,3,"Svensson, Mr. Johan Cervin",1,14.0,0,0,7538,9.2250,NaN,0,1
6,898,3,"Connolly, Miss. Kate",0,30.0,0,0,330972,7.6292,NaN,2,2
7,899,2,"Caldwell, Mr. Albert Francis",1,26.0,1,1,248738,29.0000,NaN,0,1
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",0,18.0,0,0,2657,7.2292,NaN,1,3
9,901,3,"Davies, Mr. John Samuel",1,21.0,2,0,A/4 48871,24.1500,NaN,0,1

In [39]:
data1 = test_data['SibSp'] + test_data['Parch'] + 1
test_data['Family'] = data1

In [40]:
test_data['Travel_alone'] = 0
test_data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title,Family,Travel_alone
0,892,3,"Kelly, Mr. James",1,34.500000,0,0,330911,7.8292,NaN,2,1,1,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.000000,1,0,363272,7.0000,NaN,0,3,2,0
2,894,2,"Myles, Mr. Thomas Francis",1,62.000000,0,0,240276,9.6875,NaN,2,1,1,0
3,895,3,"Wirz, Mr. Albert",1,27.000000,0,0,315154,8.6625,NaN,0,1,1,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.000000,1,1,3101298,12.2875,NaN,0,3,3,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",1,32.000000,0,0,A.5. 3236,8.0500,NaN,0,1,1,0
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.000000,0,0,PC 17758,108.9000,C105,1,5,1,0
415,1307,3,"Saether, Mr. Simon Sivertsen",1,38.500000,0,0,SOTON/O.Q. 3101262,7.2500,NaN,0,1,1,0
416,1308,3,"Ware, Mr. Frederick",1,32.000000,0,0,359309,8.0500,NaN,0,1,1,0
417,1309,3,"Peter, Master. Michael J",1,7.406471,1,1,2668,22.3583,NaN,1,4,3,0

In [41]:
test_data.loc[test_data['Family'] == 1, 'Travel_alone'] = 1

In [44]:
test_data.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title,Family,Travel_alone
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,2,1,1,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,0,3,2,0
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,2,1,1,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,0,1,1,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,0,3,3,0
5,897,3,"Svensson, Mr. Johan Cervin",1,14.0,0,0,7538,9.2250,NaN,0,1,1,1
6,898,3,"Connolly, Miss. Kate",0,30.0,0,0,330972,7.6292,NaN,2,2,1,1
7,899,2,"Caldwell, Mr. Albert Francis",1,26.0,1,1,248738,29.0000,NaN,0,1,3,0
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",0,18.0,0,0,2657,7.2292,NaN,1,3,1,1
9,901,3,"Davies, Mr. John Samuel",1,21.0,2,0,A/4 48871,24.1500,NaN,0,1,3,0

In [45]:
train_data.head(10)

   Survived  Pclass  Sex       Age     Fare  Embarked  Travel_alone  title
0         0       3    1  22.00000   7.2500         0             0      1
1         1       1    0  38.00000  71.2833         1             0      3
2         1       3    0  26.00000   7.9250         0             1      2
3         1       1    0  35.00000  53.1000         0             0      3
4         0       3    1  35.00000   8.0500         0             1      1
5         0       3    1  32.36809   8.4583         2             1      1
6         0       1    1  54.00000  51.8625         0             1      1
7         0       3    1   2.00000  21.0750         0             0      4
8         1       3    0  27.00000  11.1333         0             0      3
9         1       2    0  14.00000  30.0708         1             0      3

In [46]:
drop_elements = ["Name", "Ticket", "Cabin", "SibSp", "Parch", "Family","PassengerId"] 
test_data = test_data.drop(drop_elements, axis = 1)
test_data.head(10)

   Pclass  Sex   Age     Fare  Embarked  title  Travel_alone
0       3    1  34.5   7.8292         2      1             1
1       3    0  47.0   7.0000         0      3             0
2       2    1  62.0   9.6875         2      1             1
3       3    1  27.0   8.6625         0      1             1
4       3    0  22.0  12.2875         0      3             0
5       3    1  14.0   9.2250         0      1             1
6       3    0  30.0   7.6292         2      2             1
7       2    1  26.0  29.0000         0      1             0
8       3    0  18.0   7.2292         1      3             1
9       3    1  21.0  24.1500         0      1             0

In [47]:
test_data = test_data[['Pclass','Sex','Age','Fare','Embarked','Travel_alone','title']]
test_data.head(10)

   Pclass  Sex   Age     Fare  Embarked  Travel_alone  title
0       3    1  34.5   7.8292         2             1      1
1       3    0  47.0   7.0000         0             0      3
2       2    1  62.0   9.6875         2             1      1
3       3    1  27.0   8.6625         0             1      1
4       3    0  22.0  12.2875         0             0      3
5       3    1  14.0   9.2250         0             1      1
6       3    0  30.0   7.6292         2             1      2
7       2    1  26.0  29.0000         0             0      1
8       3    0  18.0   7.2292         1             1      3
9       3    1  21.0  24.1500         0             0      1

In [48]:
train_data.head(10)

   Survived  Pclass  Sex       Age     Fare  Embarked  Travel_alone  title
0         0       3    1  22.00000   7.2500         0             0      1
1         1       1    0  38.00000  71.2833         1             0      3
2         1       3    0  26.00000   7.9250         0             1      2
3         1       1    0  35.00000  53.1000         0             0      3
4         0       3    1  35.00000   8.0500         0             1      1
5         0       3    1  32.36809   8.4583         2             1      1
6         0       1    1  54.00000  51.8625         0             1      1
7         0       3    1   2.00000  21.0750         0             0      4
8         1       3    0  27.00000  11.1333         0             0      3
9         1       2    0  14.00000  30.0708         1             0      3

In [52]:
# from sklearn import svm

In [54]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [55]:
# clf = svm.SVC()
# clf.fit(x, y)

SVC()

In [56]:
# ypred = clf.predict(test_data)

In [59]:
# print(len(ypred), len(test_data))

418 418

In [60]:
# clf.score(x,y)

0.6823793490460157

In [61]:
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier(n_estimators=10)
model = model.fit(x,y)
model.score(x,y)

0.9741863075196409

In [62]:
ypred_forest = model.predict(test_data)

In [63]:
ypred

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0,
       0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0],
      dtype=int64)

In [64]:
ypred_forest

array([0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1,
       1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1,
       1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0],
      dtype=int64)

In [65]:
get_data = pd.read_csv("test.csv")
get_data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [66]:
#Create a CSV with results
submission = pd.DataFrame({
    "PassengerId": get_data["PassengerId"],
    "Survived": ypred_forest
})
submission.to_csv('submission.csv', index = False)

In [67]:
len(submission)

418

In [69]:
test_data.head(10)

   Pclass  Sex   Age     Fare  Embarked  Travel_alone  title
0       3    1  34.5   7.8292         2             1      1
1       3    0  47.0   7.0000         0             0      3
2       2    1  62.0   9.6875         2             1      1
3       3    1  27.0   8.6625         0             1      1
4       3    0  22.0  12.2875         0             0      3
5       3    1  14.0   9.2250         0             1      1
6       3    0  30.0   7.6292         2             1      2
7       2    1  26.0  29.0000         0             0      1
8       3    0  18.0   7.2292         1             1      3
9       3    1  21.0  24.1500         0             0      1

# Titanic movie plot 😉

In [78]:
# Jack_data = pd.DataFrame([3,1,7.8958,0,0,2], axis=1)
# Rose_data = pd.DataFrame([1,0,60.000,0,1,1], axis=1)

In [76]:
jack_data = {'Pclass':[3], 
        'Sex':[1],
        'Age':[20],
        'Fare':[7.8958],
        'Embarked':[0],
        'Travel_alone':[1],
        'title':[1]} 

rose_data = {'Pclass':[1], 
        'Sex':[0],
        'Age':[17],
        'Fare':[60.000],
        'Embarked':[0],
        'Travel_alone':[0],
        'title':[2]} 
j_data = pd.DataFrame(jack_data) 
r_data = pd.DataFrame(rose_data)

In [77]:
j_data

   Pclass  Sex  Age    Fare  Embarked  Travel_alone  title
0       3    1   20  7.8958         0             1      1

In [79]:
r_data

   Pclass  Sex  Age  Fare  Embarked  Travel_alone  title
0       1    0   17  60.0         0             0      2

In [80]:
j_pred = model.predict(j_data)
j_pred

array([0], dtype=int64)

In [81]:
r_pred = model.predict(r_data)
r_pred

array([1], dtype=int64)